Revit 2026 API

# FabricationConfigurationInfo Properties

---

The FabricationConfigurationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CloudId | The identifier of the cloud configuration. |
|  | Description | The description of the fabrication configuration. |
|  | GUID | The unique identification of the fabrication configuration. |
|  | IsCloudConfiguration | Whether the cloud configuration is a remote cloud one. |
|  | IsLocked | Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the fabrication configuration. |
|  | Path | The path where the fabrication configuration is located. To populate this property, you may need to call FindSourceFabricationConfiguration first. |
|  | UnitSystem | The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial. |
|  | Version | The version of the fabrication configuration. |

#### Reference

FabricationConfigurationInfo Class

Autodesk.Revit.DB Namespace